filestore/fourjobs/read-4k.out
ceph-fuse: (g=0): rw=read, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=32
...
ceph-kernel: (g=1): rw=read, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=32
...
fio-2.16
Starting 8 processes

ceph-fuse: (groupid=0, jobs=4): err= 0: pid=32037: Tue Feb 27 11:37:11 2018
  read : io=809388KB, bw=13489KB/s, iops=3372, runt= 60002msec
    slat (usec): min=703, max=9254, avg=1174.55, stdev=151.42
    clat (usec): min=11, max=53247, avg=36758.69, stdev=1754.44
     lat (msec): min=1, max=54, avg=37.93, stdev= 1.80
    clat percentiles (usec):
     |  1.00th=[33024],  5.00th=[34048], 10.00th=[34560], 20.00th=[35584],
     | 30.00th=[36096], 40.00th=[36096], 50.00th=[36608], 60.00th=[37120],
     | 70.00th=[37632], 80.00th=[38144], 90.00th=[38656], 95.00th=[39680],
     | 99.00th=[41728], 99.50th=[42752], 99.90th=[45824], 99.95th=[46848],
     | 99.99th=[50432]
    bw (KB  /s): min= 1846, max= 3148, per=16.42%, avg=2215.04, stdev=94.53
    lat (usec) : 20=0.01%
    lat (msec) : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.02%, 50=99.95%
    lat (msec) : 100=0.01%
  cpu          : usr=1.34%, sys=2.77%, ctx=202381, majf=0, minf=203
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=99.9%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=202347/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32
ceph-kernel: (groupid=1, jobs=4): err= 0: pid=32127: Tue Feb 27 11:37:11 2018
  read : io=5104.2MB, bw=87103KB/s, iops=21775, runt= 60005msec
    slat (usec): min=11, max=11237, avg=58.53, stdev=159.29
    clat (usec): min=344, max=70327, avg=5816.72, stdev=2085.46
     lat (usec): min=552, max=72486, avg=5875.60, stdev=2098.95
    clat percentiles (usec):
     |  1.00th=[ 1960],  5.00th=[ 2736], 10.00th=[ 3376], 20.00th=[ 4256],
     | 30.00th=[ 4768], 40.00th=[ 5216], 50.00th=[ 5536], 60.00th=[ 5984],
     | 70.00th=[ 6560], 80.00th=[ 7392], 90.00th=[ 8640], 95.00th=[ 9536],
     | 99.00th=[11200], 99.50th=[11840], 99.90th=[13120], 99.95th=[14144],
     | 99.99th=[23680]
    bw (KB  /s): min=11840, max=31936, per=25.00%, avg=21774.49, stdev=3100.80
    lat (usec) : 500=0.01%, 750=0.01%, 1000=0.02%
    lat (msec) : 2=1.05%, 4=15.25%, 10=80.26%, 20=3.40%, 50=0.01%
    lat (msec) : 100=0.01%
  cpu          : usr=2.55%, sys=30.95%, ctx=446348, majf=0, minf=199
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=1306651/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: io=809388KB, aggrb=13489KB/s, minb=13489KB/s, maxb=13489KB/s, mint=60002msec, maxt=60002msec

Run status group 1 (all jobs):
   READ: io=5104.2MB, aggrb=87102KB/s, minb=87102KB/s, maxb=87102KB/s, mint=60005msec, maxt=60005msec