filestore/fourjobs/write-1M.out
ceph-fuse: (g=0): rw=write, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=32
...
ceph-kernel: (g=1): rw=write, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=32
...
fio-2.16
Starting 8 processes

ceph-fuse: (groupid=0, jobs=4): err= 0: pid=32736: Tue Feb 27 11:47:23 2018
  write: io=2036.0MB, bw=34708KB/s, iops=33, runt= 60069msec
    slat (msec): min=35, max=1162, avg=117.94, stdev=127.45
    clat (usec): min=15, max=5098.3K, avg=3609778.93, stdev=858897.27
     lat (msec): min=70, max=5150, avg=3727.72, stdev=865.80
    clat percentiles (msec):
     |  1.00th=[  383],  5.00th=[ 1991], 10.00th=[ 2737], 20.00th=[ 3064],
     | 30.00th=[ 3294], 40.00th=[ 3490], 50.00th=[ 3687], 60.00th=[ 3884],
     | 70.00th=[ 4113], 80.00th=[ 4359], 90.00th=[ 4621], 95.00th=[ 4752],
     | 99.00th=[ 4883], 99.50th=[ 4948], 99.90th=[ 5014], 99.95th=[ 5014],
     | 99.99th=[ 5080]
    bw (KB  /s): min= 3047, max=21525, per=21.92%, avg=7607.65, stdev=4032.14
    lat (usec) : 20=0.15%, 50=0.05%
    lat (msec) : 100=0.10%, 250=0.39%, 500=0.54%, 750=0.25%, 1000=0.34%
    lat (msec) : 2000=3.29%, >=2000=94.89%
  cpu          : usr=0.12%, sys=0.35%, ctx=18349, majf=0, minf=74
  IO depths    : 1=0.2%, 2=0.4%, 4=0.8%, 8=1.6%, 16=3.1%, 32=93.9%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.8%, 8=0.0%, 16=0.0%, 32=0.2%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=2036/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32
ceph-kernel: (groupid=1, jobs=4): err= 0: pid=314: Tue Feb 27 11:47:23 2018
  write: io=2735.0MB, bw=44084KB/s, iops=43, runt= 63529msec
    slat (usec): min=92, max=4348, avg=693.99, stdev=541.72
    clat (msec): min=15, max=16807, avg=2967.03, stdev=2974.80
     lat (msec): min=16, max=16807, avg=2967.73, stdev=2974.79
    clat percentiles (msec):
     |  1.00th=[   52],  5.00th=[  231], 10.00th=[  408], 20.00th=[ 1057],
     | 30.00th=[ 1385], 40.00th=[ 1680], 50.00th=[ 2114], 60.00th=[ 2540],
     | 70.00th=[ 3195], 80.00th=[ 4047], 90.00th=[ 6390], 95.00th=[ 8979],
     | 99.00th=[14222], 99.50th=[15401], 99.90th=[15926], 99.95th=[16057],
     | 99.99th=[16712]
    bw (KB  /s): min= 4079, max=88859, per=47.42%, avg=20902.54, stdev=15415.26
    lat (msec) : 20=0.18%, 50=0.80%, 100=0.91%, 250=3.84%, 500=4.97%
    lat (msec) : 750=3.91%, 1000=4.02%, 2000=29.62%, >=2000=51.74%
  cpu          : usr=0.11%, sys=0.26%, ctx=3115, majf=0, minf=67
  IO depths    : 1=0.1%, 2=0.3%, 4=0.6%, 8=1.2%, 16=2.3%, 32=95.5%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.8%, 8=0.0%, 16=0.0%, 32=0.2%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=2735/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: io=2036.0MB, aggrb=34707KB/s, minb=34707KB/s, maxb=34707KB/s, mint=60069msec, maxt=60069msec

Run status group 1 (all jobs):
  WRITE: io=2735.0MB, aggrb=44084KB/s, minb=44084KB/s, maxb=44084KB/s, mint=63529msec, maxt=63529msec